Documents/упФактическиеДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упФактическиеДоходы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упДоходыРасходыПредприятия</xr:Item>
				<xr:Item>AccumulationRegister.упРасчетыСЗаказчиками</xr:Item>
				<xr:Item>AccumulationRegister.упДоходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентЗаказчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаФактическихДоходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыВводаФактическихДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходыНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоходыСкидка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаПеревозкуГруза</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаСумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаДобавленаНаОснованииРасхода</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗаявкиНаПеревозкуГруза</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявкаНаПеревозкуГруза</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упДоходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПланБезНДС</Name>
					<Comment>Плановая сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПланСНДС</Name>
					<Comment>Плановая сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПланВалютаБезНДС</Name>
					<Comment>Плановая сумма в валюте документа, без НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПланВалютаСНДС</Name>
					<Comment>Плановая сумма в валюте документа, с НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактБезНДС</Name>
					<Comment>Фактическая сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактСНДС</Name>
					<Comment>Фактическая сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактВалютаБезНДС</Name>
					<Comment>Фактическая сумма в валюте документа, без НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактВалютаСНДС</Name>
					<Comment>Фактическая сумма в валюте документа, с НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаПеревозкуГруза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаявкаНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/упРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПланБезНДС</Name>
					<Comment>Плановая сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПланСНДС</Name>
					<Comment>Плановая сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПланВалютаБезНДС</Name>
					<Comment>Плановая сумма в валюте документа, без НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПланВалютаСНДС</Name>
					<Comment>Плановая сумма в валюте документа, с НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактБезНДС</Name>
					<Comment>Фактическая сумма в валюте управленческого учета, без НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактСНДС</Name>
					<Comment>Фактическая сумма в валюте управленческого учета, с НДС </Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактВалютаБезНДС</Name>
					<Comment>Фактическая сумма в валюте документа, без НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФактВалютаСНДС</Name>
					<Comment>Фактическая сумма в валюте документа, с НДС</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упРейс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.упЗаданиеНаПеревозкуГруза</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитическийРазрез</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАналитическиеРазрезы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/упСпособыВводаФактическихДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыВводаФактическихДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДоходыПоОднойЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыПоНесколькимЗаявкам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment> Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment> Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment> Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment> Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упФактическиеДоходы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Процедура обработчик события ОбработкаПроведения объекта.
//
// Параметры:
//  Отказ  - Булево - Выполнить отказ.
//  РежимПроведения  - РежимПроведенияДокумента - Определяет набор режимов проведения документа.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упДоходы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);

	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	РеквизитыОбъекта = Новый Структура("Дата, 
								|Доходы, 
								|ЗаявкаНаПеревозкуГруза, 
								|Подразделение,
								|НаправлениеДеятельности,
								|СпособВводаФактическихДоходов"); 
	ЗаполнитьЗначенияСвойств(РеквизитыОбъекта, ЭтотОбъект);
		
	упРаспределениеРасходов.СформироватьДоходы(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	упУправленияЗаявками.СформироватьДвиженияФактическиеДоходыРасчетыСЗаказчиками(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если СпособВводаФактическихДоходов = Перечисления.упСпособыВводаФактическихДоходов.ДоходыПоНесколькимЗаявкам Тогда
		текИндекс = ПроверяемыеРеквизиты.Найти("ЗаявкаНаПеревозкуГруза");	
		Если НЕ текИндекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(текИндекс);
		КонецЕсли;
	Иначе
		текИндекс = ПроверяемыеРеквизиты.Найти("Доходы.ЗаявкаНаПеревозкуГруза");	
		Если НЕ текИндекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(текИндекс);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет") Тогда
		текИндекс = ПроверяемыеРеквизиты.Найти("Доходы.Валюта");	
		Если НЕ текИндекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(текИндекс);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если СпособВводаФактическихДоходов = Перечисления.упСпособыВводаФактическихДоходов.ДоходыПоОднойЗаявке Тогда
		ЗаявкиНаПеревозкуГруза.Очистить();
		НоваяСтрока = ЗаявкиНаПеревозкуГруза.Добавить();
		НоваяСтрока.ЗаявкаНаПеревозкуГруза = ЗаявкаНаПеревозкуГруза;
	КонецЕсли; 
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ВедетсяВалютныйУчет	= ПолучитьФункциональнуюОпцию("упВедетсяВалютныйУчет");
		ДополнительныеСвойства.Вставить("ВедетсяВалютныйУчет", ВедетсяВалютныйУчет);
		упРаспределениеРасходов.ЗаполнитьДоходыРасходы(ЭтотОбъект, Отказ);
		
		// Расчеты с заказчиками
		ВестиУчетРасчетовСЗаказчиками		= ПолучитьФункциональнуюОпцию("упВестиУчетРасчетовСЗаказчиками");
		ДополнительныеСвойства.Вставить("ВестиУчетРасчетовСЗаказчиками", 	 ВестиУчетРасчетовСЗаказчиками);
		АналитическийРазрезПоПартнерам		= Неопределено;
		Если ВестиУчетРасчетовСЗаказчиками Тогда
			АналитическийРазрезПоПартнерам = упУправленияЗаявками.ПодобратьАналитическийРазрезПоПартнерам(Организация, Заказчик, КонтрагентЗаказчика,Соглашение, Отказ);
			Если НЕ Отказ Тогда
				ДополнительныеСвойства.Вставить("АналитическийРазрезПоПартнерам", 	 АналитическийРазрезПоПартнерам)
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура - дозаполнить ТЧ "Доходы".
//
// Параметры:
//  Нет.
//
Процедура ЗаполнитьСтатьямиДоходовПоЗаявкам() Экспорт
	
	Запрос = Новый Запрос;
	Если СпособВводаФактическихДоходов = Перечисления.упСпособыВводаФактическихДоходов.ДоходыПоНесколькимЗаявкам Тогда
		мсвЗаявкиНаПеревозкуГруза = ЗаявкиНаПеревозкуГруза.ВыгрузитьКолонку("ЗаявкаНаПеревозкуГруза");	
		Запрос.Текст = "ВЫБРАТЬ
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтатьяДоходов,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Валюта,
		               |	СУММА(упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Количество) КАК Количество,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтавкаНДС,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Ссылка КАК ЗаявкаНаПеревозкуГруза,
		               |	МАКСИМУМ(ЛОЖЬ) КАК СтрокаДобавленаНаОснованииРасхода
		               |ИЗ
		               |	Документ.упЗаявкаНаПеревозкуГруза.ПлановыеДоходы КАК упЗаявкаНаПеревозкуГрузаПлановыеДоходы
		               |ГДЕ
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Ссылка В(&мсвЗаявок)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтатьяДоходов,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Валюта,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтавкаНДС,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Ссылка";
		Запрос.УстановитьПараметр("мсвЗаявок", мсвЗаявкиНаПеревозкуГруза);			   
	Иначе	
		Запрос.Текст = "ВЫБРАТЬ
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтатьяДоходов,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Валюта,
		               |	СУММА(упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Количество) КАК Количество,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтавкаНДС,
		               |	МАКСИМУМ(ЛОЖЬ) КАК СтрокаДобавленаНаОснованииРасхода					   
		               |ИЗ
		               |	Документ.упЗаявкаНаПеревозкуГруза.ПлановыеДоходы КАК упЗаявкаНаПеревозкуГрузаПлановыеДоходы
		               |ГДЕ
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Ссылка = &ЗаявкаНаПеревозкуГруза
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтатьяДоходов,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.Валюта,
		               |	упЗаявкаНаПеревозкуГрузаПлановыеДоходы.СтавкаНДС";
		Запрос.УстановитьПараметр("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);		   			   
	КонецЕсли;
	
	мсвСтрокиДобавленныеНаОснованииРасхода = Доходы.НайтиСтроки(Новый Структура("СтрокаДобавленаНаОснованииРасхода", Ложь));
	
	Для каждого Строка Из мсвСтрокиДобавленныеНаОснованииРасхода Цикл
		Доходы.Удалить(Строка);
	КонецЦикла;
	
	текВыборка = Запрос.Выполнить().Выбрать();
	
	Пока текВыборка.Следующий() Цикл
		НоваяСтрока = Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, текВыборка);
	КонецЦикла;

КонецПроцедуры

// Процедура - дозаполнить ТЧ "Доходы".
//
// Параметры:
//  ВедетсяВалютныйУчет  - Булево - учет.
//  ВалютаУпрУчета  - СправочникСсылка - Валюта.
//
Процедура ЗаполнитьРасходамиПоРейсам(ВедетсяВалютныйУчет, ВалютаУпрУчета) Экспорт
	
	Запрос = Новый Запрос;
	Если СпособВводаФактическихДоходов = Перечисления.упСпособыВводаФактическихДоходов.ДоходыПоНесколькимЗаявкам Тогда
		мсвЗаявкиНаПеревозкуГруза = ЗаявкиНаПеревозкуГруза.ВыгрузитьКолонку("ЗаявкаНаПеревозкуГруза");	
		Запрос.Текст = "
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упЗаданиеНаПеревозкуГруза.Ссылка КАК ЗаданиеНаПеревозкуГруза,
		|	упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
		|ГДЕ упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза В (&мсвЗаявкиНаПеревозкуГруза)
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рейс_ЗаданияТ.Задание КАК ЗаданиеНаПеревозку,
		|	Рейс_ЗаданияТ.Ссылка КАК Рейс
		|ПОМЕСТИТЬ втРейсы
		|ИЗ
		|	Документ.упРейс.Задания КАК Рейс_ЗаданияТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗаданияТ
		|	ПО Рейс_ЗаданияТ.Задание = втЗаданияТ.ЗаданиеНаПеревозкуГруза
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	КорректировкаРейса_ЗаданияТ.Задание КАК ЗаданиеНаПеревозку,
		|	КорректировкаРейса_ЗаданияТ.Ссылка.Рейс КАК Рейс
		|ИЗ
		|	Документ.упКорректировкаРейса.Задания КАК КорректировкаРейса_ЗаданияТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗаданияТ
		|	ПО КорректировкаРейса_ЗаданияТ.Задание = втЗаданияТ.ЗаданиеНаПеревозкуГруза
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упРасходыОбороты.СтатьяРасходов КАК СтатьяДоходов,
		|	СУММА(ВЫБОР
		|		КОГДА упСтатьиДоходовРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.упСтавкиНДС.НДС18_118)
		|				ИЛИ упСтатьиДоходовРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.упСтавкиНДС.НДС20_120)
		|				ИЛИ упСтатьиДоходовРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.упСтавкиНДС.НДС10_110)
		|			ТОГДА упРасходыОбороты.СуммаФактСНДСОборот
		|		ИНАЧЕ упРасходыОбороты.СуммаФактБезНДСОборот
		|	КОНЕЦ) КАК Цена,
		|	упСтатьиДоходовРасходов.СтавкаНДС КАК СтавкаНДС,
		|	втЗадания.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
		|ИЗ
		|	РегистрНакопления.упРасходы.Обороты(
		|		,
		|		,
		|		Регистратор
		|		,
		|		(Рейс, ЗаданиеНаПеревозку) В (
		|			ВЫБРАТЬ
		|				втРейсы.Рейс КАК Рейс,
		|				втРейсы.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
		|			ИЗ
		|				втРейсы КАК втРейсы)) КАК упРасходыОбороты
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упСтатьиДоходовРасходов КАК упСтатьиДоходовРасходов
		|	ПО упРасходыОбороты.СтатьяРасходов = упСтатьиДоходовРасходов.Ссылка
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗадания
		|	ПО упРасходыОбороты.ЗаданиеНаПеревозку = втЗадания.ЗаданиеНаПеревозкуГруза
		|ГДЕ упРасходыОбороты.Регистратор ССЫЛКА Документ.упФактическиеРасходы
		|СГРУППИРОВАТЬ ПО
		|	упРасходыОбороты.СтатьяРасходов,
		|	упСтатьиДоходовРасходов.СтавкаНДС,
		|	втЗадания.ЗаявкаНаПеревозкуГруза
		|";

		Запрос.УстановитьПараметр("мсвЗаявкиНаПеревозкуГруза", мсвЗаявкиНаПеревозкуГруза);			   
		
	Иначе	
				
		Запрос.Текст = "
		|//{Запрос: 0 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упЗаданиеНаПеревозкуГруза.Ссылка КАК ЗаданиеНаПеревозкуГруза,
		|	упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза КАК ЗаявкаНаПеревозкуГруза
		|ПОМЕСТИТЬ втЗадания
		|ИЗ
		|	Документ.упЗаданиеНаПеревозкуГруза КАК упЗаданиеНаПеревозкуГруза
		|ГДЕ упЗаданиеНаПеревозкуГруза.ЗаявкаНаПеревозкуГруза = &ЗаявкаНаПеревозкуГруза
		|;
		|//{Запрос: 1 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рейс_ЗаданияТ.Задание КАК ЗаданиеНаПеревозку,
		|	Рейс_ЗаданияТ.Ссылка КАК Рейс
		|ПОМЕСТИТЬ втРейсы
		|ИЗ
		|	Документ.упРейс.Задания КАК Рейс_ЗаданияТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗаданияТ
		|	ПО Рейс_ЗаданияТ.Задание = втЗаданияТ.ЗаданиеНаПеревозкуГруза
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	КорректировкаРейса_ЗаданияТ.Задание КАК ЗаданиеНаПеревозку,
		|	КорректировкаРейса_ЗаданияТ.Ссылка.Рейс КАК Рейс
		|ИЗ
		|	Документ.упКорректировкаРейса.Задания КАК КорректировкаРейса_ЗаданияТ
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ втЗадания КАК втЗаданияТ
		|	ПО КорректировкаРейса_ЗаданияТ.Задание = втЗаданияТ.ЗаданиеНаПеревозкуГруза
		|;
		|//{Запрос: 2 ////////////////////////////////////////
		|ВЫБРАТЬ
		|	упРасходыОбороты.СтатьяРасходов КАК СтатьяДоходов,
		|	СУММА(ВЫБОР
		|		КОГДА упСтатьиДоходовРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.упСтавкиНДС.НДС18_118)
		|				ИЛИ упСтатьиДоходовРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.упСтавкиНДС.НДС20_120)
		|				ИЛИ упСтатьиДоходовРасходов.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.упСтавкиНДС.НДС10_110)
		|			ТОГДА упРасходыОбороты.СуммаФактСНДСОборот
		|		ИНАЧЕ упРасходыОбороты.СуммаФактБезНДСОборот
		|	КОНЕЦ) КАК Цена,
		|	упСтатьиДоходовРасходов.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	РегистрНакопления.упРасходы.Обороты(
		|		,
		|		,
		|		Регистратор,
		|		(Рейс, ЗаданиеНаПеревозку) В (
		|				ВЫБРАТЬ
		|				втРейсы.Рейс КАК Рейс,
		|				втРейсы.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку
		|			ИЗ
		|				втРейсы КАК втРейсы)) КАК упРасходыОбороты
		|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.упСтатьиДоходовРасходов КАК упСтатьиДоходовРасходов
		|	ПО упРасходыОбороты.СтатьяРасходов = упСтатьиДоходовРасходов.Ссылка
		|ГДЕ упРасходыОбороты.Регистратор ССЫЛКА Документ.упФактическиеРасходы
		|СГРУППИРОВАТЬ ПО
		|	упРасходыОбороты.СтатьяРасходов,
		|	упСтатьиДоходовРасходов.СтавкаНДС
		|";

		Запрос.УстановитьПараметр("ЗаявкаНаПеревозкуГруза", ЗаявкаНаПеревозкуГруза);		   
	КонецЕсли;
	
	мсвСтрокиДобавленныеНаОснованииРасхода = Доходы.НайтиСтроки(Новый Структура("СтрокаДобавленаНаОснованииРасхода", Истина));
	
	Для каждого Строка Из мсвСтрокиДобавленныеНаОснованииРасхода Цикл
		Доходы.Удалить(Строка);
	КонецЦикла;
	
	текВыборка = Запрос.Выполнить().Выбрать();
	СтруктураДанные = Новый Структура("Ссылка, Соглашение", Ссылка, ПредопределенноеЗначение("Справочник.упСоглашенияСКлиентами.ПустаяСсылка"));
	Пока текВыборка.Следующий() Цикл
		НоваяСтрока = Доходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, текВыборка);
		НоваяСтрока.Количество = 1;
		НоваяСтрока.СтрокаДобавленаНаОснованииРасхода = Истина;
		Если ВедетсяВалютныйУчет Тогда
			НоваяСтрока.Валюта = ВалютаУпрУчета;	
		Иначе
			НоваяСтрока.Валюта = ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка");	
		КонецЕсли;
		упОбработкаТабличнойЧастиКлиентСервер.ПересчитатьСтрокуПриИзмененииЗначения(НоваяСтрока,"Цена",СтруктураДанные);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#КонецЕсли
